benchmark/old_outputs/sieve_threads_128/uni_16/2026-04-19T17:24:11-04:00_1_1_1.5.txt
pgbench (19devel)
transaction type: multiple scripts
scaling factor: 1000
query mode: simple
number of clients: 16
number of threads: 2
maximum number of tries: 1
duration: 180 s
number of transactions actually processed: 1610949
number of failed transactions: 0 (0.000%)
latency average = 1.788 ms
initial connection time = 11.842 ms
tps = 8949.910034 (without initial connection time)
SQL script 1: pgscripts/uniform_select.sql
 - weight: 1 (targets 50.0% of total)
 - 806056 transactions (50.0% of total)
 - number of transactions actually processed: 806056 (tps = 4478.185643)
 - number of failed transactions: 0 (0.000%)
 - latency average = 0.700 ms
 - latency stddev = 0.639 ms
SQL script 2: pgscripts/uniform_update.sql
 - weight: 1 (targets 50.0% of total)
 - 802977 transactions (49.8% of total)
 - number of transactions actually processed: 802977 (tps = 4461.079717)
 - number of failed transactions: 0 (0.000%)
 - latency average = 2.869 ms
 - latency stddev = 3.161 ms
ratio: .6648927923693465